InformationRegisters/ПротоколОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПротоколОбменов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаголовкиЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HTTPМетод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/УчетныеЗаписиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВнутреннихКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Утилиты/Ext/Module.bsl
// Общие утилиты StockAPI: разбор параметров запроса, пагинация, форматирование ошибок.

Функция СтрокаПараметраЗапроса(Запрос, ИмяПараметра) Экспорт
	
	Значение = Запрос.ПараметрыЗапроса.Получить(ИмяПараметра);
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СокрЛП(Строка(Значение));
	
КонецФункции

Функция ДатаПараметраЗапроса(Запрос, ИмяПараметра) Экспорт
	
	СтрокаДаты = СтрокаПараметраЗапроса(Запрос, ИмяПараметра);
	Если СтрокаДаты = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Если СтрДлина(СтрокаДаты) >= 10 Тогда
			СтрокаДаты = Лев(СтрокаДаты, 10);
		КонецЕсли;
		Возврат Дата(СтрокаДаты);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЦелоеПараметраЗапроса(СтрокаЗначения, ЗначениеПоУмолчанию) Экспорт
	
	Если СтрокаЗначения = Неопределено Или СокрЛП(СтрокаЗначения) = "" Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Попытка
		ЧислоЗначения = Число(СтрокаЗначения);
	Исключение
		Возврат -1;
	КонецПопытки;
	
	Если ЧислоЗначения <> Цел(ЧислоЗначения) Тогда
		Возврат -1;
	КонецЕсли;
	
	Возврат Цел(ЧислоЗначения);
	
КонецФункции

Функция ВсегоСтраницПагинации(ВсегоЭлементов, РазмерСтраницы) Экспорт
	
	Если ВсегоЭлементов = 0 Или РазмерСтраницы <= 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Цел((ВсегоЭлементов - 1) / РазмерСтраницы) + 1;
	
КонецФункции

// Разбор параметров пагинации: page (с 1), pageSize/limit (макс. 500). 
//
Функция ПараметрыПагинацииОстатков(Запрос) Экспорт
	
	МаксРазмерСтраницы = 500;
	РазмерПоУмолчанию = 500;
	Результат = Новый Структура("page, pageSize, Ошибка", 1, РазмерПоУмолчанию, "");
	
	СтрокаСтраницы = Запрос.ПараметрыЗапроса.Получить("page");
	СтрокаРазмера = Запрос.ПараметрыЗапроса.Получить("pageSize");
	Если СтрокаРазмера = Неопределено Или СокрЛП(СтрокаРазмера) = "" Тогда
		СтрокаРазмера = Запрос.ПараметрыЗапроса.Получить("limit");
	КонецЕсли;
	
	НомерСтраницы = ЦелоеПараметраЗапроса(СтрокаСтраницы, 1);
	Если НомерСтраницы < 0 Тогда
		Результат.Ошибка = "Параметр page должен быть целым числом >= 1.";
		Возврат Результат;
	КонецЕсли;
	Если НомерСтраницы = 0 Тогда
		НомерСтраницы = 1;
	КонецЕсли;
	
	РазмерСтраницы = ЦелоеПараметраЗапроса(СтрокаРазмера, РазмерПоУмолчанию);
	Если РазмерСтраницы < 0 Тогда
		Результат.Ошибка = "Параметр pageSize (или limit) должен быть целым числом от 1 до 500.";
		Возврат Результат;
	КонецЕсли;
	Если РазмерСтраницы = 0 Тогда
		РазмерСтраницы = РазмерПоУмолчанию;
	КонецЕсли;
	Если РазмерСтраницы > МаксРазмерСтраницы Тогда
		Результат.Ошибка = СтрШаблон("pageSize не может превышать %1.", МаксРазмерСтраницы);
		Возврат Результат;
	КонецЕсли;
	
	Результат.page = НомерСтраницы;
	Результат.pageSize = РазмерСтраницы;
	Возврат Результат;
	
КонецФункции

// Собирает все строки из СписокЗначений в одну строку с переносами.
//
Функция ТекстОшибокСписка(Ошибки) Экспорт
	
	Текст = "";
	Для Каждого Ошибка Из Ошибки Цикл
		Текст = Текст + Ошибка.Значение + Символы.ПС;
	КонецЦикла;
	Возврат СокрЛП(Текст);
	
КонецФункции

//// serials=with|without. ПоУмолчаниюССериями — если параметр не передан.       
////
//Функция ПараметрSerialsЗапроса(Запрос, ПоУмолчаниюССериями = Истина) Экспорт
//	
//	Результат = Новый Структура("ССериями, Ошибка", ПоУмолчаниюССериями, "");
//	СтрокаПараметра = НРег(СтрокаПараметраЗапроса(Запрос, "serials"));
//	Если СтрокаПараметра = "" Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	Если СтрокаПараметра = "with"
//		Или СтрокаПараметра = "true"
//		Или СтрокаПараметра = "1"
//		Или СтрокаПараметра = "yes" Тогда
//		Результат.ССериями = Истина;
//	ИначеЕсли СтрокаПараметра = "without"
//		Или СтрокаПараметра = "false"
//		Или СтрокаПараметра = "0"
//		Или СтрокаПараметра = "no" Тогда
//		Результат.ССериями = Ложь;
//	Иначе
//		Результат.Ошибка = "Неподдерживаемый serials. Допустимые значения: with, without.";
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции


// © Primus1C  15.06.2026  НАЧАЛО ►

// Возвращает криптографически стойкий хеш SHA-256 (строка 64 символа в нижнем регистре)   
//
Функция СгенерироватьТокенSHA256() Экспорт
	
	// 1. Формируем уникальную исходную строку (соль)
	// Комбинация GUID и времени до миллисекунд исключает совпадения даже теоретически
	УникальнаяСтрока = Строка(Новый УникальныйИдентификатор) 
	                 + Строка(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	// 2. Инициализируем объект хеширования алгоритмом SHA-256
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	
	// 3. Вычисляем хеш для нашей строки
	Хеширование.Добавить(УникальнаяСтрока);
	
	// 4. Получаем результат в виде двоичных данных
	ДвоичныеДанныеХеша = Хеширование.ХешСумма;
	
	// 5. Конвертируем в шестнадцатеричную строку (Hex)
	СтрокаHex = НРег(ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанныеХеша));
	
	Возврат СтрокаHex;
	
КонецФункции

Функция ПроверитьКлючAPI(ЗапросАПИ, КонтекстАвторизации) Экспорт
	
	// Ожидаем, что клиент присылает ключ в заголовке X-Api-Key
	КлючКлиента = ЗапросАПИ.Заголовки.Получить("X-Api-Key");

	Если Не ЗначениеЗаполнено(КлючКлиента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросБД = Новый Запрос;
	ЗапросБД.Текст = 
		"ВЫБРАТЬ
		|	УчетныеЗаписиИнтеграции.Контрагент КАК Контрагент,
		|	УчетныеЗаписиИнтеграции.Ссылка КАК УчетнаяЗапись
		|ИЗ
		|	Справочник.УчетныеЗаписиИнтеграции КАК УчетныеЗаписиИнтеграции
		|ГДЕ
		|	УчетныеЗаписиИнтеграции.ТокенАвторизации = &КлючAPI
		|	И УчетныеЗаписиИнтеграции.Активен";
		
	ЗапросБД.УстановитьПараметр("КлючAPI", КлючКлиента);
	Выборка = ЗапросБД.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КонтекстАвторизации.Вставить("Контрагент", Выборка.Контрагент);
		КонтекстАвторизации.Вставить("УчетнаяЗапись", Выборка.УчетнаяЗапись);  
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция КодВСтроку(Код) Экспорт
	
	Если Код = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Формат(Код, "ЧГ=0");
	
КонецФункции

Процедура ЗаписатьВПротокол(Запрос, Ответ, ПользовательИнтеграции, ДлительностьМс, ТекстОшибкиВнутр = "") Экспорт
	
	Попытка
		МЗ = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
		
		// Измерения и базовые реквизиты
		МЗ.ИдентификаторЗапроса = Новый УникальныйИдентификатор;
		МЗ.Дата = ТекущаяДатаСеанса();
		МЗ.ИмяСервиса = "StockAPI";
		//МЗ.ШаблонURL = Запрос.ШаблонURL;
		
		Попытка
			// Запись перечисления (GET, POST и т.д.)
			МЗ.HTTPМетод = Перечисления.HTTPМетод[Запрос.HTTPМетод];
		Исключение
		КонецПопытки;
		
		МЗ.КодСостояния = Ответ.КодСостояния;
		МЗ.Длительность = ДлительностьМс;
		МЗ.Пользователь = ПользовательИнтеграции;
		МЗ.ТекстОшибки = Лев(ТекстОшибкиВнутр, 200);
		
		// Определение IP адреса
		IP = Запрос.Заголовки.Получить("X-Forwarded-For");
		Если IP = Неопределено Тогда
			IP = Запрос.Заголовки.Получить("Remote-Addr");
		КонецЕсли;
		МЗ.IPАдрес = ?(IP = Неопределено, "", Лев(IP, 50));
		
		// Запись ресурсов (ХранилищеЗначения)
		МЗ.ЗаголовкиЗапроса = Новый ХранилищеЗначения(СтруктураВJSON(Запрос.Заголовки), Новый СжатиеДанных(9));
		МЗ.ТелоЗапроса = Новый ХранилищеЗначения(Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8), Новый СжатиеДанных(9));
		МЗ.ТелоОтвета = Новый ХранилищеЗначения(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8), Новый СжатиеДанных(9));
		
		МЗ.Записать();
	Исключение
		// Ошибка записи лога не должна ронять сам API
		ЗаписьЖурналаРегистрации("StockAPI.Протоколирование", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры




#Область Неактуально

Функция АвторизоватьЗапрос(Запрос, ПользовательИнтеграции, Ответ) Экспорт
	
	ЗаголовокAuth = Запрос.Заголовки.Получить("Authorization");
	Если ЗаголовокAuth = Неопределено Или Не СтрНачинаетсяС(ЗаголовокAuth, "Basic ") Тогда
		УстановитьОшибкуАвторизации(Ответ, "Отсутствует или неверен заголовок Authorization");
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаBase64 = СтрЗаменить(ЗаголовокAuth, "Basic ", "");
	Попытка
		// Декодируем учетные данные из Base64
		ДвоичныеДанныеAuth = Base64Значение(СтрокаBase64);
		УчетныеДанные = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеAuth, КодировкаТекста.UTF8);
	Исключение
		УстановитьОшибкуАвторизации(Ответ, "Ошибка декодирования Base64");
		Возврат Ложь;
	КонецПопытки;
	
	ПозицияДвоеточия = СтрНайти(УчетныеДанные, ":");
	Если ПозицияДвоеточия = 0 Тогда
		УстановитьОшибкуАвторизации(Ответ, "Неверный формат учетных данных (ожидается логин:пароль)");
		Возврат Ложь;
	КонецЕсли;
	
	Логин = Лев(УчетныеДанные, ПозицияДвоеточия - 1);
	Пароль = Сред(УчетныеДанные, ПозицияДвоеточия + 1);
	
	// Поиск активной учетной записи
	ЗапросБД = Новый Запрос;
	ЗапросБД.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УчетныеЗаписиИнтеграции КАК УЗ
		|ГДЕ
		|	УЗ.Логин = &Логин
		|	И УЗ.Пароль = &Пароль
		|	И УЗ.Активен = ИСТИНА
		|	И НЕ УЗ.ПометкаУдаления";
	ЗапросБД.УстановитьПараметр("Логин", Логин);
	ЗапросБД.УстановитьПараметр("Пароль", Пароль);
	
	Выборка = ЗапросБД.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПользовательИнтеграции = Выборка.Ссылка;
		Возврат Истина;
	КонецЕсли;
	
	УстановитьОшибкуАвторизации(Ответ, "Неверный логин или пароль, либо учетная запись отключена");
	Возврат Ложь;
	
КонецФункции

Процедура УстановитьОшибкуАвторизации(Ответ, ТекстОшибки)
	Ответ = Новый HTTPСервисОтвет(401);
	Ответ.Заголовки.Вставить("WWW-Authenticate", "Basic realm=""StockAPI""");
	
	Тело = Новый Структура("error", ТекстОшибки);
	Ответ.УстановитьТелоИзСтроки(СтруктураВJSON(Тело), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
КонецПроцедуры      

Функция ВыполнитьМетодAPI(Запрос, ИмяМетодаОбработчика) Экспорт
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПользовательИнтеграции = Справочники.УчетныеЗаписиИнтеграции.ПустаяСсылка();
	Ответ = Неопределено;
	ТекстОшибкиВнутр = "";
	
	// Шаг 1. Аутентификация
	Если Не АвторизоватьЗапрос(Запрос, ПользовательИнтеграции, Ответ) Тогда
		ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
		ЗаписатьВПротокол(Запрос, Ответ, ПользовательИнтеграции, ВремяВыполнения, "Ошибка авторизации");
		Возврат Ответ;
	КонецЕсли;
	
	// Шаг 2. Выполнение бизнес-логики (например, StockAPI_Заказы.СоздатьЗаказПокупателя)
	Попытка
		// Вызываем метод, передавая Запрос. В метод можно добавить и передачу ПользовательИнтеграции,
		// чтобы определять Контрагента или доступные Склады прямо из учетной записи.
		РезультатОбработки = Вычислить(ИмяМетодаОбработчика + "(Запрос)");
		
		// Формируем финальный HTTP-ответ
		Ответ = Новый HTTPСервисОтвет(РезультатОбработки.КодОтвета);
		Ответ.УстановитьТелоИзСтроки(СтруктураВJSON(РезультатОбработки.Тело), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		
	Исключение
		ИнфоОшибка = ИнформацияОбОшибке();
		ТекстОшибкиВнутр = КраткоеПредставлениеОшибки(ИнфоОшибка);
		
		Ответ = Новый HTTPСервисОтвет(500);
		ТелоОшибки = Новый Структура("error", "Внутренняя ошибка сервера API");
		Ответ.УстановитьТелоИзСтроки(СтруктураВJSON(ТелоОшибки), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	КонецПопытки;
	
	// Шаг 3. Запись в Регистр Сведений
	ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
	ЗаписатьВПротокол(Запрос, Ответ, ПользовательИнтеграции, ВремяВыполнения, ТекстОшибкиВнутр);
	
	Возврат Ответ;
	
КонецФункции

// Вспомогательная функция для JSON
//
Функция СтруктураВJSON(Значение)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

#КонецОбласти


// © Primus1C  ОКОНЧАНИЕ ◄
